# Dmitrii Dudchenko
#5. Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма
# (прибыль — выручка больше издержек, или убыток — издержки больше выручки).
# Выведите соответствующее сообщение. Если фирма отработала с прибылью,
# вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.
a = int(input("Enter your profit\n"))
b = int(input("Enter your costs\n"))
net = a - b

if net >= 0:
    print(f"Net={net}")
else:
    print("No profit")
